Autodesk.Revit.DB.ExportFontTable.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.ExportFontTable.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.ExportFontTable.GetExportFontTableIterator
Returns a FontTableIterator to the font table.
Since:
2014

Autodesk.Revit.DB.ExportFontTable.Clear
Removes all contents stored in the table.
Since:
2014

Autodesk.Revit.DB.ExportFontTable.Remove(Autodesk.Revit.DB.ExportFontKey)
Removes the pair (key, info) by font key.
exportFontKey:
The export font key.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportFontTable.Add(Autodesk.Revit.DB.ExportFontKey,Autodesk.Revit.DB.ExportFontInfo)
Inserts a (key,info) pair into Export font table.
exportFontKey:
The export font key to be added.
exportFontInfo:
The export font info to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The key already exists in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportFontTable.GetValues
Returns a collection of the values stored in this table.
Returns:
The collection of values.
Since:
2014

Autodesk.Revit.DB.ExportFontTable.GetKeys
Returns a collection of the keys stored in this table.
Returns:
The collection of keys.
Since:
2014

Autodesk.Revit.DB.ExportFontTable.GetExportFontInfo(Autodesk.Revit.DB.ExportFontKey)
Gets a copy of the font info associated to the input font key.
exportFontKey:
The export font Key.
Returns:
Returns the fontInfo for this key.
Throws Autodesk.Revit.Exceptions.ArgumentException:
An entry with the given key is not present in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportFontTable.ContainsKey(Autodesk.Revit.DB.ExportFontKey)
Checks whether a font key exists in the table.
exportfontKey:
The export font Key.
Returns:
True if the font key exists in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportFontTable.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExportFontTable.Count
Count of the items contained in the collection.
Since:
2014

Autodesk.Revit.DB.ExportFontTable.default(Autodesk.Revit.DB.ExportFontKey)
A copy of the Autodesk.Revit.DB.ExportFontInfo for the font's Autodesk.Revit.DB.ExportFontKey.
Remarks: When getting this property, it returns a copy of the Autodesk.Revit.DB.ExportFontInfo from the table.  In order to
make changes to the Autodesk.Revit.DB.ExportFontInfo and use those settings during export, set the modified
Autodesk.Revit.DB.ExportFontInfo back into the table using the same key.
exportPatternKey:
The key.
Returns:
A copy of the Autodesk.Revit.DB.ExportFontInfo.
Throws Autodesk.Revit.Exceptions.ArgumentException: When getting this property:
An entry with the given key is not present in the table.
Since:
2014

Autodesk.Revit.DB.ExportFontTable.GetFontTableIterator
Returns a FontTableIterator that iterates through the collection.
Returns: A FontTableIterator object that can be used to iterate through key-value pairs in the collection.

Autodesk.Revit.DB.ExportFontTable.#ctor
Constructs a new ExportFontTable with default values.
Since:
2014

Autodesk.Revit.DB.ExportFontTable
A table supporting a mapping of Revit font names to font names that will be set
in the target export format.
Remarks:
This table is structured as a mapping from Autodesk.Revit.DB.ExportFontKey to
Autodesk.Revit.DB.ExportFontInfo members.  The Autodesk.Revit.DB.ExportFontKey
contains the indentification information for the font table: the Revit font name.  The
Autodesk.Revit.DB.ExportFontInfo contains the font name to use in the export format.
The table can be accessed via direct iteration as a collection of KeyValuePairs, or by traversal of the stored keys
obtained from GetKeys(), or via specific lookup of a key constructed externally.  In all cases, the
Autodesk.Revit.DB.ExportFontInfo returned will be a copy of the Autodesk.Revit.DB.ExportFontInfo
from the table.  In order to make changes to the Autodesk.Revit.DB.ExportFontInfo and use those settings during export,
set the modified Autodesk.Revit.DB.ExportFontInfo back into the table using the same key.
Since:
2014